-- -------------------------------------------------------------
-- TablePlus 2.8.2(257)
--
-- https://tableplus.com/
--
-- Database: zwy-stock
-- Generation Time: 2026-03-27 10:51:08.1750
-- -------------------------------------------------------------


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


INSERT INTO `stock_in_out_record` (`id`, `row_no`, `category_id`, `is_outbound`, `category_name`, `product_type`, `product_name`, `product_brand`, `product_spec`, `product_description`, `pn_code`, `material_code`, `serial_number`, `target_device_type`, `target_device_brand`, `target_device_model`, `major_category`, `usage_scene`, `document_no`, `inbound_qty`, `inbound_date`, `inbound_room`, `storage_location`, `stock_qty`, `outbound_qty`, `outbound_date`, `actual_device_type`, `actual_device_brand`, `actual_device_model`, `device_position`, `original_owner_org`, `target_room`, `remark`, `expansion_remark`, `source_sheet`, `source_row_no`, `create_time`, `update_time`, `create_timestamp`, `update_timestamp`, `is_deleted`, `status`) VALUES ('1', '1', NULL, '1', '交换机', '交换机配件', '光模块', '华为', '10G单模模块80KM', '万兆单模80km：OSX080N01，光模块-SFP+-10G-单模模块(1550nm,80km,LC)', 'OSX080N01', NULL, '1', '交换机', '华为', 'CE6810', '交换机配件', 'CE6810交换机', '00012-20221116-光模块', '1', '2022-11-16', NULL, NULL, '0', '1', '2022-11-16', NULL, NULL, NULL, '名㺯203、名美301', NULL, NULL, NULL, NULL, '出入库明细表', '2', '2026-03-27 10:48:32', '2026-03-27 10:48:32', '1774579712', '1774579712', '0', '1'),
('2', '2', '650', '1', '防火墙', '防火墙整机', '边界防火墙', '华为', 'USG6620E-K', '信创名录产品：华为USG6620E-K，USG6620E-K交流主机(16*GE RJ45 + 6*GE SFP + 6*10GE SFP+,16G内存,1交流电源,含SSL VPN 100用户)\nUSG6620E-K交流主机(16*GE RJ45 + 6*GE SFP + 6*10GE SFP+,16G内存,1交流电源,含SSL VPN 100用户)_Hi-Care基础服务标准 USG6620E-K_36月', '02353PTA', NULL, '2', '防火墙', '华为', 'USG6620E-K', '防火墙', '上架到名美203机房G列', '2-221130-边界防火墙', '1', '2022-11-30', NULL, NULL, '0', '1', '2022-11-30', NULL, NULL, NULL, '上架到名美203机房G列', NULL, NULL, NULL, NULL, '出入库明细表', '3', '2026-03-27 10:48:32', '2026-03-27 10:48:32', '1774579712', '1774579712', '0', '1'),
('3', '3', '679', '1', '交换机', '交换机整机', '核心交换机', '华为', 'CE16808', '华为CE16808交换机，带48端口10GE以太网光接口板。\nCE16808交流组合配置2-D2G(含交流/高压直流总装机箱,2*主控板D-2,5*交换网板G-G,4*3000W交流&高压直流电源模块,满配风机盒)_Hi-Care基础服务标准 CE16808主机_36月', '02354TEP-002', NULL, '3', '交换机', '华为', 'CE16808', '交换机', '上架到名美203机房G列', '3-221201-核心交换机', '1', '2022-12-01', NULL, NULL, '0', '1', '2022-12-01', NULL, NULL, NULL, '上架到名美203机房G列', NULL, NULL, NULL, NULL, '出入库明细表', '4', '2026-03-27 10:48:32', '2026-03-27 10:48:32', '1774579712', '1774579712', '0', '1'),
('4', '4', '680', '1', '交换机', '交换机整机', '接入交换机', '华为', 'CE6857F-48S6CQ', '华为CE6857F-48S6CQ 交换机(48*10GE SFP+,6*100GE QSFP28,2*交流电源,4*风机盒,端口侧进风)\nCE6857F-48S6CQ 交换机(48*10GE SFP+,6*100GE QSFP28,2*交流电源,4*风机盒,端口侧进风)_Hi-Care基础服务标准 CE6857-48S6CQ-EI_36月', '02354HPY-001', NULL, '4', '交换机', '华为', 'CE6857F-48S6CQ', '交换机', '上架到名美203机房G列', '4-221201-接入交换机', '1', '2022-12-01', NULL, NULL, '0', '1', '2022-12-01', NULL, NULL, NULL, '上架到名美203机房G列', NULL, NULL, NULL, NULL, '出入库明细表', '5', '2026-03-27 10:48:32', '2026-03-27 10:48:32', '1774579712', '1774579712', '0', '1'),
('5', '5', '681', '1', '交换机', '交换机配件', '光模块', '华为', '100G多模模块', 'CE6800散配包：100GBase-SR4光模块-QSFP28-100G-多模模块(850nm,0.1km,MPO)\n100GBase-SR4光模块-QSFP28-100G-多模模块(850nm,0.1km,MPO)_Hi-Care基础服务标准 100G-SR_36月', '02313URQ', NULL, '5', '交换机', '华为', 'CE6800', '交换机', '交换机使用', '5-221201-接入交换机', '1', '2022-12-01', NULL, NULL, '0', '1', '2022-12-01', NULL, NULL, NULL, '名美203机房G04', NULL, NULL, NULL, NULL, '出入库明细表', '6', '2026-03-27 10:48:32', '2026-03-27 10:48:32', '1774579712', '1774579712', '0', '1'),
('6', '6', '682', '1', '交换机', '交换机配件', '光模块', '华为', '10G多模模块', 'CE6800散配包：光模块-SFP+-10G-多模模块(850nm,0.3km,LC)', '02313URC', NULL, '6', '交换机', '华为', 'CE6800', '交换机', '交换机使用', '6-221201-接入交换机', '1', '2022-12-01', NULL, NULL, '0', '1', '2022-12-01', NULL, NULL, NULL, '名美203机房G04', NULL, NULL, NULL, NULL, '出入库明细表', '7', '2026-03-27 10:48:32', '2026-03-27 10:48:32', '1774579712', '1774579712', '0', '1'),
('7', '7', '660', '1', '交换机', '交换机配件', '光模块', '华为', '1G多模模块', 'CE6800散配包：光模块-eSFP-GE-多模模块(850nm,0.55km,LC)', '02313URD', NULL, '7', '交换机', '华为', 'CE6800', '交换机配件', '交换机使用', '7-221201-多模光模块', '1', '2022-12-01', NULL, NULL, '0', '1', '2022-12-01', NULL, NULL, NULL, '名㺯203、名美301', NULL, NULL, NULL, NULL, '出入库明细表', '8', '2026-03-27 10:48:32', '2026-03-27 10:48:32', '1774579712', '1774579712', '0', '1'),
('8', '8', '660', '0', '交换机', '交换机配件', '光模块', '华为', '1G多模模块', 'CE6800散配包：光模块-eSFP-GE-多模模块(850nm,0.55km,LC)', '02313URD', NULL, '8', '交换机', '华为', 'CE6800', '交换机配件', '交换机使用', '7-221201-多模光模块', '1', '2022-12-01', '名美', '名美右二', '1', '0', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '出入库明细表', '9', '2026-03-27 10:48:32', '2026-03-27 10:48:32', '1774579712', '1774579712', '0', '1'),
('9', '9', '660', '0', '交换机', '交换机配件', '光模块', '华为', '1G多模模块', 'CE6800散配包：光模块-eSFP-GE-多模模块(850nm,0.55km,LC)', '02313URD', NULL, '9', '交换机', '华为', 'CE6800', '交换机配件', '交换机使用', '7-221201-多模光模块', '1', '2022-12-01', '名美', '名美右二', '1', '0', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '出入库明细表', '10', '2026-03-27 10:48:32', '2026-03-27 10:48:32', '1774579712', '1774579712', '0', '1'),
('10', '10', '660', '0', '交换机', '交换机配件', '光模块', '华为', '1G多模模块', 'CE6800散配包：光模块-eSFP-GE-多模模块(850nm,0.55km,LC)', '02313URD', NULL, '10', '交换机', '华为', 'CE6800', '交换机配件', '交换机使用', '7-221201-多模光模块', '1', '2022-12-01', '名美', '名美右二', '1', '0', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '出入库明细表', '11', '2026-03-27 10:48:32', '2026-03-27 10:48:32', '1774579712', '1774579712', '0', '1'),
('11', '11', '660', '0', '交换机', '交换机配件', '光模块', '华为', '1G多模模块', 'CE6800散配包：光模块-eSFP-GE-多模模块(850nm,0.55km,LC)', '02313URD', NULL, '11', '交换机', '华为', 'CE6800', '交换机配件', '交换机使用', '7-221201-多模光模块', '1', '2022-12-01', '名美', '名美右二', '1', '0', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '出入库明细表', '12', '2026-03-27 10:48:32', '2026-03-27 10:48:32', '1774579712', '1774579712', '0', '1'),
('12', '12', '660', '0', '交换机', '交换机配件', '光模块', '华为', '1G多模模块', 'CE6800散配包：光模块-eSFP-GE-多模模块(850nm,0.55km,LC)', '02313URD', NULL, '12', '交换机', '华为', 'CE6800', '交换机配件', '交换机使用', '7-221201-多模光模块', '1', '2022-12-01', '名美', '名美右二', '1', '0', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '出入库明细表', '13', '2026-03-27 10:48:32', '2026-03-27 10:48:32', '1774579712', '1774579712', '0', '1'),
('13', '13', '660', '0', '交换机', '交换机配件', '光模块', '华为', '1G多模模块', 'CE6800散配包：光模块-eSFP-GE-多模模块(850nm,0.55km,LC)', '02313URD', NULL, '13', '交换机', '华为', 'CE6800', '交换机配件', '交换机使用', '7-221201-多模光模块', '1', '2022-12-01', '名美', '名美右二', '1', '0', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '出入库明细表', '14', '2026-03-27 10:48:32', '2026-03-27 10:48:32', '1774579712', '1774579712', '0', '1'),
('14', '14', '660', '0', '交换机', '交换机配件', '光模块', '华为', '1G多模模块', 'CE6800散配包：光模块-eSFP-GE-多模模块(850nm,0.55km,LC)', '02313URD', NULL, '14', '交换机', '华为', 'CE6800', '交换机配件', '交换机使用', '7-221201-多模光模块', '1', '2022-12-01', '名美', '名美右二', '1', '0', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '出入库明细表', '15', '2026-03-27 10:48:32', '2026-03-27 10:48:32', '1774579712', '1774579712', '0', '1'),
('15', '15', '660', '0', '交换机', '交换机配件', '光模块', '华为', '1G多模模块', 'CE6800散配包：光模块-eSFP-GE-多模模块(850nm,0.55km,LC)', '02313URD', NULL, '15', '交换机', '华为', 'CE6800', '交换机配件', '交换机使用', '7-221201-多模光模块', '1', '2022-12-01', '名美', '名美右二', '1', '0', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '出入库明细表', '16', '2026-03-27 10:48:32', '2026-03-27 10:48:32', '1774579712', '1774579712', '0', '1'),
('16', '16', '660', '0', '交换机', '交换机配件', '光模块', '华为', '1G多模模块', 'CE6800散配包：光模块-eSFP-GE-多模模块(850nm,0.55km,LC)', '02313URD', NULL, '16', '交换机', '华为', 'CE6800', '交换机配件', '交换机使用', '7-221201-多模光模块', '1', '2022-12-01', '名美', '名美右二', '1', '0', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '出入库明细表', '17', '2026-03-27 10:48:32', '2026-03-27 10:48:32', '1774579712', '1774579712', '0', '1');


/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;
/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;